{"classes":["INGREDIENT"],"annotations":[["- [Michael] You got it?",{"entities":[]}],["- [Dwight] Mhm.",{"entities":[]}],["- Okay.",{"entities":[]}],["Fettuccine Alfredo.",{"entities":[]}],["Time to carbo-load.",{"entities":[]}],["Mm.",{"entities":[]}],["- [Babish] Hey, what's up, guys?",{"entities":[]}],["Welcome back to Binging with Babish where this week we're taking a look at the fettuccine Alfredo from The Office or more accurately, we're using it as an excuse to make some fettuccine Alfredo because I want some.",{"entities":[]}],["First up, the absolute bare bones for Alfredo, some jarred sauce and some boxed pasta which ironically is what I assume Alfredo's from The Office would have made because they're supposed to be really, really bad.",{"entities":[]}],["So we're cooking some fettuccine to a state of doneness, draining off camera.",{"entities":[]}],["You're just gonna have to believe me that that's what I did and smothering with our jarred Alfredo, mixing for an even coat and the first problem you're gonna notice with this Alfredo despite the thick gloopy sauce, it just doesn't adhere to the store-bought pasta.",{"entities":[]}],["It looks all kinda streaky and greasy and not terribly good and that's because the American or cream-based version of this dish just doesn't play nice with anybody but fresh pasta.",{"entities":[]}],["The next thing you're gonna notice is that this jarred sauce mostly tastes of garlic which is weird.",{"entities":[]}],["I don't know who told Ragú that there's garlic in Alfredo.",{"entities":[]}],["For a truly great American Alfredo, we turn to America's Test Kitchen who prescribes that we combine one cup of heavy cream and two tablespoons of butter in a large saute pan cooking over medium high heat until reduced by about half.",{"entities":[[101,123,"INGREDIENT"],[128,153,"INGREDIENT"]]}],["At which point we're gonna add a half cup of cold heavy cream to stop the cooking process then we are grating two ounces of Parmigiano-Reggiano cheese and cooking a standard issue nine ounce package of fresh pasta for about two minutes.",{"entities":[[33,61,"INGREDIENT"],[110,150,"INGREDIENT"],[180,213,"INGREDIENT"]]}],["At which point we're gonna retrieve it with some tongs and drop it into the cream, butter mixture which we're gonna heat over a medium low flame as we add our Parmesan cheese, a good pinch of kosher salt and a few twists of freshly ground black pepper.",{"entities":[[76,81,"INGREDIENT"],[83,89,"INGREDIENT"],[159,174,"INGREDIENT"],[183,203,"INGREDIENT"],[232,251,"INGREDIENT"]]}],["Stir that around just to combine and then we're also gonna add a quarter cup of pasta cooking water which is gonna help give us a cohesive sauce and a little grating of fresh nutmeg.",{"entities":[[65,99,"INGREDIENT"]]}],["It's just gonna taste really, really good.",{"entities":[]}],["Toss that around until you've got a creamy sauce, serve up.",{"entities":[]}],["Maybe a little bit of extra freshly grated nutmeg overtop and inspect.",{"entities":[]}],["As you can see, the sauce doesn't look overly greasy or gloopy.",{"entities":[]}],["It's light and creamy and is the most delicious way I could imagine carbo-loading before a 5K which you guys know I'm a stickler for accuracy so I'm gonna package this up and tote it out to Prospect Park where Sawyer is gonna assist me the same way Dwight did with the Parmesan cheese.",{"entities":[]}],["I'm gonna eat as much as I possibly can for strength and endurance and run the loop which is almost a perfect 5K.",{"entities":[]}],["Sure, I haven't ran in a year and a half but this will probably be fine, right?",{"entities":[]}],["As you can see from my body cam, I did indeed run the full 5K without puke breaks or water breaks just like Michael and in the end, I really cannot recommend it.",{"entities":[]}],["What's more is I know the Italians will absolutely murder me unless I make an authentic pasta al burro.",{"entities":[]}],["So to start, we're gonna make our own fresh pasta.",{"entities":[]}],["Into a food processor goes 12 ounces of all-purpose flour and one teaspoon of salt.",{"entities":[[27,57,"INGREDIENT"],[62,82,"INGREDIENT"]]}],["Process briefly together and then we're adding eight ounces of eggs which I did not measure but the beauty of the food processor method is that you can add flour as you go.",{"entities":[[47,67,"INGREDIENT"]]}],["So instead of having to trash this batch, I added a little bit at a time and processed it for about a minute so as to build up a complex network of gluten and give the pasta a lovely chew.",{"entities":[]}],["Once processed, we're gonna wrap it in plastic wrap and let it rest, maybe after a ceremonial punch in the face, for 30 minutes before dividing, rolling and cutting.",{"entities":[]}],["To do this, we're basically gonna grab us a hunk of pasta, generously flour it and roll it out ever thinner one notch at a time on our pasta roller until it gets a little bit too long for our delicate sensibilities and we have to cut it in half and continue to roll it out into two sheets of delicate fresh pasta which we are going to once again generously flour before passing it through the cutters which should help prevent the pasta from sticking together when we twist it into a darling little nest and arrange said nest on a heavily floured rim baking sheet.",{"entities":[]}],["Next up, pasta al burro is traditionally prepared tableside so we have to ladle some boiling water into our intended heat-proof mixing bowl to keep it warm then we are cooking our fresh pasta for anywhere from 60 to 90 seconds until it floats at which point it's ready to be tossed together with cheese and butter to make pasta al burro or semi-traditional fettuccine Alfredo.",{"entities":[]}],["Into our heated bowl goes five ounces of unsalted butter and two and a half ounces of freshly grated Parmigiano-Reggiano followed by our fresh cooked pasta then we're gonna top that pasta with an additional two and a half ounces of freshly grated Parmigiano-Reggiano as well as a quarter cup of our starchy pasta cooking water which is essential to create a creamy emulsified sauce.",{"entities":[[26,56,"INGREDIENT"],[207,266,"INGREDIENT"],[280,326,"INGREDIENT"]]}],["Next up, we're tossing this around with a hefty pinch of kosher salt and no freshly ground black pepper.",{"entities":[[48,68,"INGREDIENT"],[84,103,"INGREDIENT"]]}],["That is not a traditional ingredient in pasta al burro.",{"entities":[]}],["Bonus points if you can toss it in the air a little bit to aerate the sauce then you can twist her up with your favorite carving fork and serve with a little bit of freshly grated Parm overtop.",{"entities":[]}],["Now, like most classic Italian pasta dishes, this one's greatness comes from its simplicity, quality ingredients coming together to make something beautiful but I gotta say my absolute favorite part is not having to run a 5K afterward.",{"entities":[]}],["( calm music )",{"entities":[]}],["- [Andrew] This episode is sponsored by Squarespace.",{"entities":[]}],["I used Squarespace to build both BasicsWithBabish and BingingWithBabish.com.",{"entities":[]}],["On the sites, you'll find recipes, equipment lists, other news, and updates.",{"entities":[]}],["All beautifully designed if I do say so myself.",{"entities":[]}],["Get 10% off your first Squarespace order by visiting squarespace.com/Babish.",{"entities":[]}],["( upbeat theme music) - All right, so the easiest way to make Tteokbokki or Spicy Korean Rice Cakes, is to buy store-bought rice cakes.",{"entities":[]}],["These are usually frozen, and you should soak them in water for about 10 minutes before use.",{"entities":[]}],["I can't speak Korean, but I'm guessing this little packet says \" do not eat \".",{"entities":[]}],["Good and let those hang out and 10 minutes later they're going to look exactly the same.",{"entities":[]}],["In fact, I'm not really sure what this step is for but every recipe I could find said to do it.",{"entities":[]}],["Once we've got those drained and patted dry, we're ready to start talking sauce.",{"entities":[]}],["For the most basic version of which we're going to need at least three things: some gochugaru, or Korean chili flakes, and some gochujang, a fermented chili paste.",{"entities":[[79,93,"INGREDIENT"],[98,117,"INGREDIENT"],[141,162,"INGREDIENT"]]}],["And some dashi, an anchovy-based broth that lends a whole lot of umami and a light seafood flavor.",{"entities":[]}],["I'm adding one tablespoon of dashi flakes to three cups of water.",{"entities":[[11,41,"INGREDIENT"]]}],["If you can't find dashi flakes, you could just use some seafood or chicken flavored bullion.",{"entities":[[56,63,"INGREDIENT"],[67,91,"INGREDIENT"]]}],["But for one pound of rice cakes, we want three cups of broth, A heaping quarter cup of gochujang, and anywhere from a half teaspoon, to two full teaspoons of gochugaru, depending on how spicy you like things to get.",{"entities":[[8,31,"INGREDIENT"],[41,60,"INGREDIENT"],[72,96,"INGREDIENT"],[118,167,"INGREDIENT"]]}],["Go ahead and tiny whisk those together over medium high heat until they are homogenous.",{"entities":[]}],["And once the mixture comes to a bare simmer we're going to add our rice cakes.",{"entities":[]}],["Bring it back up to a simmer, crank the heat back down to medium-low and maintain a simmer for anywhere from 7 to 10 minutes until the rice cakes are cooked and the sauce is thick.",{"entities":[]}],["One of my very favorite things about Tteokbokki is that the rice cakes are super chewy so don't expect them to turn out too tender or mushy or anything.",{"entities":[]}],["You can serve them as is, or top them simply with scallions.",{"entities":[]}],["And there you have it, a baseline bowl of Tteokboki.",{"entities":[]}],["The rice cakes are chewy and bouncy.",{"entities":[]}],["The sauce is spicy and maybe a little sweet ff you add an optional tablespoon of sugar.",{"entities":[[67,86,"INGREDIENT"]]}],["And everything's just loaded with umami from the dashi broth.",{"entities":[]}],["But what if you want to make these super legit?",{"entities":[]}],["First, we have to tackle the question of rice cakes.",{"entities":[]}],["If you can't find them at the store and you want to make them yourself they're traditionally made with glutinous rice flour but this can be very hard to find.",{"entities":[]}],["Luckily, plain old rice flour, while not being traditional, works just fine.",{"entities":[[9,29,"INGREDIENT"]]}],["In a large heat-proof bowl, we are combining 345 grams of rice flour with a half teaspoon of kosher salt.",{"entities":[]}],["Then we are adding anywhere from 200 to 300 grams of boiling water.",{"entities":[]}],["Different rice flours absorb water differently, so it's going to vary depending on what you've got.",{"entities":[]}],["But in this recipe I adapted from from internet legend, Maangchi, you want to add just enough water to make a dough that has no dry patches when you massage it together.",{"entities":[]}],["Once you've got a cohesive, tacky ball of dough we're going to partially cover our bowl with microwave-safe cling film leaving about a one-inch vent on the side so things don't get too hot as we microwave it on high power for two minutes.",{"entities":[]}],["After which time, we're going to take it out, remove the plastic wrap.",{"entities":[]}],["Be careful 'cause it's going to be pretty hot.",{"entities":[]}],["So we're going to use a rubber spatula to sort of mix up and fold over the dough a couple times.",{"entities":[]}],["Nothing fancy, we just want to make sure that everything is getting heated evenly as we microwave it a second time, two more minutes yet again on high power.",{"entities":[]}],["This time the dough is going to be very hot but we must use this opportunity while it's still malleable to both develop its starch content, and shape it into our intended shapes.",{"entities":[]}],["So we're treating our work surface with a little bit of sesame oil, turning out our dough, and commencing to pounding.",{"entities":[]}],["That is using a heavy bottom saucepan or meat mallet to pound out the dough to about a half inch thickness.",{"entities":[]}],["Then we're going to fold it over upon itself, like a pamphlet, so sort of into thirds, and repeat the process probably for about 10 to 15 times.",{"entities":[]}],["This is going to build up the starch content and give us that nice dense chewy texture we so desire.",{"entities":[]}],["After half a dozen or so turns, you're going to find that the dough's a lot more agreeable and you'll be able to roll it out rather than pound it.",{"entities":[]}],["Keep going until the dough is completely smooth and then it's time to roll out and cut.",{"entities":[]}],["First, I'm gonna roll the dough out one more time into a sort of rectangle which I'm going to roll up into a log, kind of like, a cinnamon roll made of rice flour and water.",{"entities":[]}],["Then I'm going to divide this into two portions, each of which I'm going to roll out into a long thin log.",{"entities":[]}],["At some point it might get a little bit too long, you might want to divide it in half yet again.",{"entities":[]}],["But ultimately we're looking for a log about a quarter inch wide which we're then going to be able to subdivide into individual rice cakes.",{"entities":[]}],["These should be somewhere between one to two inches long and can be optionally cut on the diagonals so as to make sort of rice cake parallelograms.",{"entities":[]}],["Definitely had to Google image search what a parallelogram was because it's been a long time since high school trig.",{"entities":[]}],["And there you have it, homemade rice cakes.",{"entities":[]}],["Rinse and repeat with the remaining dough and then to prevent these guys from sticking, we're going to roll 'em around with a little bit of Sesame oil.",{"entities":[[140,150,"INGREDIENT"]]}],["These can then be frozen or fridged until ready to use.",{"entities":[]}],["Then if you want to be a really super bad-ass about this process, you can make your own dashi.",{"entities":[]}],["First, we're going to start with eight to ten large dried anchovies whose heads we must remove and guts we must evacuate.",{"entities":[[33,67,"INGREDIENT"]]}],["Basically right behind the head, there's this big old clump of black stuff and you just want to kind of squeeze and shimmy that out.",{"entities":[]}],["This is all kind of a gross, oily and smelly process so just grin and bear it because your taste buds will thank you for it later.",{"entities":[]}],["We're placing our beheaded and degutted anchovies in a large high-walled sautee pan with a quarter ounce of dried shrimp.",{"entities":[[91,120,"INGREDIENT"]]}],["And then we need about an ounce of dried kelp, or Kombu, broken up into pieces.",{"entities":[[26,45,"INGREDIENT"]]}],["These need to be removed before everything else so make sure you leave them in large enough pieces that you can fish out.",{"entities":[]}],["Then I've got one whole onion, root removed, and quartered.",{"entities":[[14,29,"INGREDIENT"]]}],["A bunch of scallions cut into two or three inch \" batons \" and a couple large cloves of garlic cut in half.",{"entities":[[2,20,"INGREDIENT"],[76,92,"INGREDIENT"]]}],["Make sure to take any and all appropriate dramatic license with slicing and inserting your garlic.",{"entities":[]}],["And that's really all there is to making dashi broth.",{"entities":[]}],["Oh wait, except for one thing, maybe the most, I don't know, important substance on earth: water.",{"entities":[]}],["Sorry, if you can't tell I'm doing this voiceover late at night and I'm getting a little punchy.",{"entities":[]}],["We're bringing this guy up to the simmer and keeping him there for 10 solid minutes, before removing the sheets of Kombu.",{"entities":[]}],["Once removed, we're letting everything simmer for an additional 20 minutes or until your neighbors complain to the cops that you're running an illegal fishery in your apartment.",{"entities":[]}],["Go ahead and remove that from the heat, strain out the solids and same deal as last time, three cups of the stuff in a large wide saute pan along with a quarter cup of gochujang, and depending on your spice preference, your preferred amount of gochugaru.",{"entities":[[153,177,"INGREDIENT"]]}],["I'm also adding about a tablespoon of Korean soy sauce and a tablespoon of light corn syrup.",{"entities":[[22,54,"INGREDIENT"],[61,91,"INGREDIENT"]]}],["But like I mentioned before, you can just use sugar.",{"entities":[]}],["I'm also crushing in one or two large cloves of garlic.",{"entities":[[28,54,"INGREDIENT"]]}],["T-whisking until homogeneous, bring it to a simmer and dumping in one pound of our homemade rice cakes.",{"entities":[]}],["Then while these simmer we're going to add an optional, but widely used ingredient, an assortment of fish cakes which you can find frozen in the same place as you'd find the rice cakes.",{"entities":[]}],["Then it's the same deal as before, simmer for anywhere from 7 to 15 minutes, until the sauce is reduced and thick.",{"entities":[]}],["Then we're finishing things off with a little drizzle of toasted sesame oil for both flavor and the gloss factor and plating up tall and proud as before.",{"entities":[[65,75,"INGREDIENT"]]}],["But this time with a sprinkle of toasted black and white sesame seeds.",{"entities":[[41,69,"INGREDIENT"]]}],["This is going to bring a lot of flavor and a little bit of crunch.",{"entities":[]}],["Our obligatory sliced scallions.",{"entities":[]}],["And there you have it, some totally from scratch and much more legit Tteokbokki which has got to be one of my favorite dishes of all time.",{"entities":[]}],["Just like before we got chewy rice cakes and spicy savory sauce, but the flavors are deeper.",{"entities":[]}],["And so to are my emotions for them.",{"entities":[]}],["Last up we're going to cover stir-fried Tteokbokki.",{"entities":[]}],["This time, we're assembling the sauce off-heat.",{"entities":[]}],["Two or three tablespoons gochujang, one teaspoon of gochugaru, one clove of crushed garlic a tablespoon of Korean soy sauce.",{"entities":[[0,34,"INGREDIENT"],[36,61,"INGREDIENT"],[63,90,"INGREDIENT"],[93,123,"INGREDIENT"]]}],["You can just use regular soy sauce, If you can't find Korean soy sauce.",{"entities":[[17,34,"INGREDIENT"],[54,70,"INGREDIENT"]]}],["A quarter cup of dashi, a tablespoon of light corn syrup, and a teaspoon of toasted sesame oil.",{"entities":[[2,22,"INGREDIENT"],[26,56,"INGREDIENT"],[64,94,"INGREDIENT"]]}],["Tiny whisk this to combine, and then we're headed over to the stove top where we're starting by par-cooking our rice cakes in boiling water rather than the sauce.",{"entities":[]}],["We're letting those boil for about six minutes.",{"entities":[]}],["Preheating two or so tablespoons of vegetable oil in a large Wok.",{"entities":[[11,49,"INGREDIENT"]]}],["Thoroughly draining the rice cakes and dumping 'em in.",{"entities":[]}],["Frying for about three to five minutes on each side, until you get a nice deep golden crust, and a profoundly crunchy exterior.",{"entities":[]}],["This could take a surprisingly long amount of time but these guys don't burn easy, so, just take your time, make sure that you've got a nice crust and once you do, lower the heat and add a few tablespoons of our pre-prepared sauce.",{"entities":[]}],["There is sugar in the sauce and we don't want it to burn so make sure that you don't heat it too much.",{"entities":[]}],["We just want it to caramelize a little bit and cook into our rice cakes.",{"entities":[]}],["As usual tossing is optional, but preferred.",{"entities":[]}],["Then you can go ahead and kill the heat, add some optional sesame seeds.",{"entities":[]}],["And once everything's thick and sticky, plate up with an extra drizzle of sauce and an extra sprinkling of sesame seeds and scallions.",{"entities":[]}],["And there you have it chewy, crispy, saucy pan-fried Tteokbokki.",{"entities":[]}],["Dear Diary, Today, one of my very favorite things got even better.",{"entities":[]}],["Thanks again to Squarespace for sponsoring today's episode.",{"entities":[]}],["They've been a great partner in supporting the Babish Culinary Universe and bringing my websites to life.",{"entities":[]}],["From websites to online stores, to domains and analytics.",{"entities":[]}],["Squarespace is the all-in-one platform for you to build your online presence.",{"entities":[]}],["They also have SEO tools so that your site is getting found in search by more people, more often.",{"entities":[]}],["If you want to try it for yourself, you can start your free trial today by visiting Squarespace.com/Babish to get 10% off your first purchase.",{"entities":[]}],["( music fades out )",{"entities":[]}],["- [Narrator] This was the glorious time.",{"entities":[]}],["No more race to the cafeteria.",{"entities":[]}],["No more lines.",{"entities":[]}],["To us lines were for suckers, hacks, sheep.",{"entities":[]}],["We were wolves and we had the chicken to prove it.",{"entities":[]}],["( applauding) - To victory.",{"entities":[]}],["It feels unfamiliar, but it tastes like chicken.",{"entities":[]}],["( chuckles) - Hey, what's up guys.",{"entities":[]}],["Welcome back to Binging with Babish where this week I'm using the mention of chicken fingers on community as an excuse to make what remains my Applebee's entree of choice, chicken fingers.",{"entities":[]}],["For the sure accurate version, I've got some frozen ones here, which is undoubtedly what they'd serve at Greendale Community College and every cafeteria in the noted world.",{"entities":[]}],["And just for funsies I'm gonna prepare these three different ways, in the oven, in the microwave and in the deep fryer, which surprisingly is the only method not described on the packaging.",{"entities":[]}],["So we're gonna fried it at 350, for three to five minutes until crisp.",{"entities":[]}],["And to illustrate the differences I'm busting out the microphone.",{"entities":[]}],["Let's start with the microwave finger.",{"entities":[]}],["Any crunch there?",{"entities":[]}],["Nope, not at all.",{"entities":[]}],["What about the oven?",{"entities":[]}],["( crunch) A little better now.",{"entities":[]}],["Now how about the deep fryer?",{"entities":[]}],["( crunch) Interesting.",{"entities":[]}],["Now for the bite test.",{"entities":[]}],["First, I have to lick my lips to gross you out a little bit.",{"entities":[]}],["Then let's start with the microwave stuff.",{"entities":[]}],["Soft, soggy, wildly chewy.",{"entities":[]}],["Can't recommend that.",{"entities":[]}],["Onto the oven baked version.",{"entities":[]}],["A little better.",{"entities":[]}],["And the deep fried version.",{"entities":[]}],["All right.",{"entities":[]}],["So, entirely unsurprisingly, the deep fried version is best.",{"entities":[]}],["As much as I know you'd love to keep hearing mouth noises, I figured we should fry up our own.",{"entities":[]}],["Let's start with the absolute baseline simplest of breadings.",{"entities":[]}],["Four large eggs beaten together, with a little bit of salt and two cups of all-purpose flour, with one teaspoon each of kosher salt and freshly ground black pepper.",{"entities":[[0,15,"INGREDIENT"],[54,58,"INGREDIENT"],[63,92,"INGREDIENT"],[99,131,"INGREDIENT"],[144,163,"INGREDIENT"]]}],["For our fingers, we're gonna use eight chicken tenders, which are that little annoying bit, right below the breast.",{"entities":[[33,54,"INGREDIENT"]]}],["And for a restaurant style coating, we are double dipping them.",{"entities":[]}],["First in the egg, then to the flour, then back into the egg and one more time in the flour.",{"entities":[]}],["You can of course do this one at a time but I actually found doing them in bulk gave the chicken an even cracklier, more profound crust.",{"entities":[]}],["Once you've shaken off all the excess, we are letting them hang out for five minutes before frying in some 375 degrees Fahrenheit peanut oil for five to seven minutes.",{"entities":[[130,140,"INGREDIENT"]]}],["Letting chicken rest for five to 10 minutes before frying, hydrates the flour and helps form a barrier around your chicken.",{"entities":[]}],["And draining on paper towels gets rid of excess oil and keeps them crispier longer.",{"entities":[]}],["Let's see how we do on the crunch test.",{"entities":[]}],["( crunch) Not bad at all, but as you can imagine, very boring flavor.",{"entities":[]}],["Not to mention a little dry.",{"entities":[]}],["Both things that we can remedy by brining.",{"entities":[]}],["Into a food safe container, goes one cup of buttermilk and a whole jars worth of pickle juice.",{"entities":[[33,54,"INGREDIENT"],[81,93,"INGREDIENT"]]}],["Legend has it, this is what makes Chick-fil-A taste so good.",{"entities":[]}],["We're also adding a teaspoon each kosher salt and freshly ground black pepper.",{"entities":[[18,45,"INGREDIENT"],[58,77,"INGREDIENT"]]}],["A tiny pinch of cayenne for heat, a half teaspoon of paprika for color and a bay leaf for bay-leafiness.",{"entities":[[2,23,"INGREDIENT"],[36,60,"INGREDIENT"],[77,85,"INGREDIENT"]]}],["Tiny whisk until the (indistinct), add your one pound of chicken tenders, massage for even distribution, cover and refrigerate for bare minimum eight hours.",{"entities":[[44,72,"INGREDIENT"]]}],["And if you're crazy like me, up to 48.",{"entities":[]}],["In our breading we're gonna use three egg whites, who's higher protein and lower fat content should give us a more robust crust.",{"entities":[[32,48,"INGREDIENT"]]}],["For the dry stuff, we're combining two cups of all-purpose flour, with a quarter cup cornstarch for extra crispiness and a half teaspoon paprika, quarter teaspoon cayenne, four teaspoon garlic powder, two teaspoon onion powder and one teaspoon each kosher salt and freshly ground black pepper.",{"entities":[[35,64,"INGREDIENT"],[73,95,"INGREDIENT"],[123,144,"INGREDIENT"],[146,170,"INGREDIENT"],[172,199,"INGREDIENT"],[201,226,"INGREDIENT"],[231,260,"INGREDIENT"],[273,292,"INGREDIENT"]]}],["And to make these really crisp as a hundred dollar bill, we're gonna add one cup of finely crushed corn flakes.",{"entities":[[73,110,"INGREDIENT"]]}],["Tiny whisk until completely homogenous and then to create extra crunchy crackles, we're gonna add about two tablespoons of our marinade to the dry stuff and tiny whisk together to make little lumps that will fry up into crispity, crunchity goodness.",{"entities":[]}],["Now I am so confident in our breading that I'm only gonna dip these guys once.",{"entities":[]}],["That's right.",{"entities":[]}],["It's not because I forgot to do it and it's too late to re-shoot because the chicken takes two days to marinate and it is currently Monday.",{"entities":[]}],["No, sir.",{"entities":[]}],["This is confidence, not incompetence.",{"entities":[]}],["Anyway, in addition to letting our chicken hangout for five minutes, I'm also gonna sort of bury it in the leftover dry stuff.",{"entities":[]}],["And then you can trust that your crust will be robust.",{"entities":[]}],["Even if you're a dumb, dumb boy, who forgot to double dip.",{"entities":[]}],["Over on the stove top, we've got some peanut oil heated to 375 Fahrenheit.",{"entities":[]}],["Usual drill here, fry for five to seven minutes until the chicken is deeply golden brown and the meat is cooked through.",{"entities":[]}],["Once again, we are draining on paper towels to absorb excess oil and check it out.",{"entities":[]}],["Add five mushrooms, two onion leafs, and one garlic clove; cook and stir until tender.",{"entities":[[4,18,"INGREDIENT"],[20,35,"INGREDIENT"],[41,57,"INGREDIENT"]]}],["Even without double-dipping, this crust is superb.",{"entities":[]}],["Let's listen in.",{"entities":[]}],["( crunch) Now, the crust was very good but what was really amazing was the chicken.",{"entities":[]}],["It spent so much time in the marinade it was almost falling apart.",{"entities":[]}],["But after frying, it was ultra tender, ultra juicy and tasted pleasantly of pickles.",{"entities":[]}],["Is this what they were serving at the cafeterias at Greendale?",{"entities":[]}],["Most assuredly not.",{"entities":[]}],["But fellow human beings, they are delicious.",{"entities":[]}],["They're Chang-tacular.",{"entities":[]}],["Eat fresh.",{"entities":[]}],["( upbeat music )",{"entities":[]}]]}